const FooterDeatails: React.FC = () => {
  return (
    <>
      <div className="w-full">
        <div className="text-shadow-custom py-6 text-sm text-gray-7f">
          价格仅供参考，具体价格请以华为商城展示为准。
          <br />
          <br />
          以上页面中的产品图片、视频及屏幕内容仅作示意，实物产品效果（包括但不限于外观、颜色、尺寸）和屏幕显示内容（包括但不限于背景、UI、配图、视频）可能略有差异，请以实物为准。
          <br />
          <br />
          部分产品配件需单独购买，页面效果仅供参考。
          <br />
          <br />
          以上页面中的数据为理论值，均来自华为内部实验室，于特定测试环境下所得（请见各项具体说明），实际使用中可能因产品个体差异、软件版本、使用条件和环境因素不同略有不同，请以实际使用的情况为准。
          <br />
          <br />
          由于产品批次和生产供应因素实时变化，为尽可能提供准确的产品信息、规格参数、产品特性，华为可能实时调整和修订以上页面中的文字表述、图片效果等内容，以求与实际产品性能、规格、指数、零部件等信息相匹配。
          <br />
          <br />
          如遇确有进行上述修改和调整必要的情形，恕不专门通知。
        </div>
      </div>
    </>
  );
};

export default FooterDeatails;
